Revit 2027 API
PostEventArgs.Status Property
 Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an APIevent handler).
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public EventStatus Status { get; }
Public ReadOnly Property Status As EventStatus
	Get
public:
property EventStatus Status {
	EventStatus get ();
}
member Status : EventStatus with get
Property Value
EventStatus
See Also
Reference
PostEventArgs Class
Autodesk.Revit.DB.Events Namespace